
&НаСервере
Процедура Аид_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Аид_СоздатьЭлементыФормыСервер();
	
	Аид_СтатусКонтрагента = Объект.Аид_СтатусКонтрагента;
	Аид_ЧасовойПояс = Объект.Аид_ЧасовойПояс;
	Аид_ДругойЧасовойПояс = Объект.Аид_ДругойЧасовойПояс;
	
	Элементы.Аид_ЧасовойПояс.СписокВыбора.Очистить();
	СписокЧП = Аид_СписокВыбораЧасовыхПоясов();
	Для каждого ЭлемЧП из СписокЧП Цикл
		Элементы.Аид_ЧасовойПояс.СписокВыбора.Добавить(ЭлемЧП.Значение, ЭлемЧП.Представление);
	КонецЦикла;
	Аид_УстановитьВидимость();

КонецПроцедуры


Функция Аид_СписокВыбораЧасовыхПоясов()
	
	Возврат Аид_ОбщегоНазначенияПереопределяемый.ПолучитьСписокЧасовыхПоясов();
	
КонецФункции

&НаСервере
Процедура Аид_ПолучитьЧасовойПоясПослеНаСервере()
	
	ЧасовойПояс = Аид_ОбщегоНазначенияПереопределяемый.ПолучитьЧасовойПоясКонтрагента(Объект.Ссылка);
	
	Если ЧасовойПояс = неопределено Тогда
		//Пробуем еще определить по контрагенту.
		ЧасовойПояс = Аид_ОбщегоНазначенияПереопределяемый.ПолучитьЧасовойПоясКонтрагента(Объект.Ссылка);
	КонецЕсли;
	
	Если ЧасовойПояс = неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить часовой пояс контрагента. Проверьте заполнение адреса!");
	Иначе
		Аид_ЧасовойПояс = ЧасовойПояс;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Аид_ПолучитьЧасовойПоясПосле(Команда)
	Аид_ПолучитьЧасовойПоясПослеНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура Аид_УстановитьВидимость()
	Элементы.Аид_ЧасовойПояс.Видимость = Аид_ДругойЧасовойПояс;
	Элементы.ПолучитьЧасовойПояс.Видимость = Аид_ДругойЧасовойПояс;
КонецПроцедуры

&НаКлиенте
Процедура Аид_ДругойЧасовойПоясПриИзмененииПосле(Элемент)
	Аид_УстановитьВидимость();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура Аид_ЧасовойПоясПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура Аид_СоздатьЭлементыФормыСервер()
	
	Если Элементы.Найти("Аид_СтатусКонтрагента") = Неопределено тогда
		НовыйЭлементСтатусКонтрагента = Элементы.Вставить("Аид_СтатусКонтрагента", Тип("ПолеФормы"), Элементы.ГруппаАдреса, Неопределено);
		НовыйЭлементСтатусКонтрагента.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлементСтатусКонтрагента.ПутьКДанным = "Объект.Аид_СтатусКонтрагента";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Аид_СтатусКонтрагентаПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура Аид_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Аид_СтатусКонтрагента = Аид_СтатусКонтрагента;
	ТекущийОбъект.Аид_ЧасовойПояс = Аид_ЧасовойПояс;
	ТекущийОбъект.Аид_ДругойЧасовойПояс = Аид_ДругойЧасовойПояс;

КонецПроцедуры
