
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипСообщения", ЭтотОбъект.ТипСообщенияОтбор) тогда
		Если ЭтотОбъект.ТипСообщенияОтбор = Перечисления.табАид_ТипыСообщений.Email тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,"ПредназначенДляЭлектронныхПисем",Истина,,,Истина);
		ИначеЕсли ЭтотОбъект.ТипСообщенияОтбор = Перечисления.табАид_ТипыСообщений.SMS тогда	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,"ПредназначенДляSMS",Истина,,,Истина);
		ИначеЕсли ЭтотОбъект.ТипСообщенияОтбор = Перечисления.табАид_ТипыСообщений.ГолосовоеСообщение тогда	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,"табАид_ПредназначенДляГолосовогоСообщения",Истина,,,Истина);
		иначе
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПредназначенДляЭлектронныхПисем");
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПредназначенДляSMS");
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "табАид_ПредназначенДляГолосовогоСообщения");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,"Назначение","ТАБ АИД",,,Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьШаблон(Команда)
	ВидСообщения = "";
	Если ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.ГолосовоеСообщение") Тогда
		ВидСообщения = "ГолосовоеСообщение";
	ИначеЕсли ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.SMS") Тогда
		ВидСообщения = "СообщениеSMS";
	ИначеЕсли ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.Email") Тогда
		ВидСообщения = "Почта";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидСообщения", ВидСообщения);
	ПараметрыФормы.Вставить("ЭтоТАБАИД",       Истина);
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры
