//&Вместо("КонтактноеЛицоПоУмолчанию")

//Функция Аид_КонтактноеЛицоПоУмолчанию(Владелец) Экспорт

//		//Аид
//	КонтактноеЛицоАИД = Аид_ПолучитьКонтактноеЛицоПартнера(Владелец);
//	Если ЗначениеЗаполнено(КонтактноеЛицоАИД) Тогда
//		Возврат КонтактноеЛицоАИД;
//	КонецЕсли;
//	//Аид

//	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
//		ОсновноеКонтактноеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ОсновноеКонтактноеЛицо");
//	КонецЕсли;

//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Владелец", Владелец);
//	Запрос.УстановитьПараметр("ОсновноеКонтактноеЛицо", ОсновноеКонтактноеЛицо);
//	
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
//	|	КонтактныеЛица.Ссылка,
//	|	ВЫБОР
//	|		КОГДА КонтактныеЛица.Ссылка = &ОсновноеКонтактноеЛицо
//	|			ТОГДА 1
//	|		ИНАЧЕ 2
//	|	КОНЕЦ КАК ПорядокСортировки
//	|ИЗ
//	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
//	|ГДЕ
//	|	КонтактныеЛица.ОбъектВладелец = &Владелец
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ПорядокСортировки";
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.Ссылка;
//	КонецЕсли;
//	
//	Возврат Справочники.КонтактныеЛица.ПустаяСсылка();

//КонецФункции

//Функция Аид_ПолучитьКонтактноеЛицоПартнера(Партнер) Экспорт
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Партнер", Партнер);
//	Запрос.Текст = "ВЫБРАТЬ
//	|	Аид_КонтактныеЛицаКонтрагентов.КонтактноеЛицо КАК КонтактноеЛицо
//	|ИЗ
//	|	РегистрСведений.Аид_КонтактныеЛицаКонтрагентов КАК Аид_КонтактныеЛицаКонтрагентов
//	|ГДЕ
//	|	Аид_КонтактныеЛицаКонтрагентов.Контрагент = &Партнер";
//	Результат = Запрос.Выполнить().Выбрать();
//	Если Результат.Следующий() Тогда
//		Возврат Результат.КонтактноеЛицо;
//	КонецЕсли;
//	Возврат Справочники.КонтактныеЛица.ПустаяСсылка();
//КонецФункции
