
&НаСервере
Процедура табАид_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	табАид_СтатусПартнера = Объект.табАид_СтатусПартнера;
	табАид_ЧасовойПояс = Объект.табАид_ЧасовойПояс;
	табАид_ДругойЧасовойПояс = Объект.табАид_ДругойЧасовойПояс;
	Элементы.табАид_ЧасовойПояс.СписокВыбора.Очистить();
	СписокЧП = табАид_СписокВыбораЧасовыхПоясов();
	Для каждого ЭлемЧП из СписокЧП Цикл
		Элементы.табАид_ЧасовойПояс.СписокВыбора.Добавить(ЭлемЧП.Значение, ЭлемЧП.Представление);
	КонецЦикла;
	табАид_УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура табАид_СтатусПартнераПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура табАид_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.табАид_СтатусПартнера = табАид_СтатусПартнера;
	ТекущийОбъект.табАид_ЧасовойПояс = табАид_ЧасовойПояс;
	ТекущийОбъект.табАид_ДругойЧасовойПояс = табАид_ДругойЧасовойПояс;
КонецПроцедуры

Функция табАид_СписокВыбораЧасовыхПоясов()
	Возврат табАид_ОбщегоНазначенияПереопределяемый.ПолучитьСписокЧасовыхПоясов();
КонецФункции

&НаСервере
Процедура табАид_ПолучитьЧасовойПоясПослеНаСервере()
	ЧасовойПояс = табАид_ОбщегоНазначенияПереопределяемый.ПолучитьЧасовойПоясПартнера(Объект.Ссылка);
	Если ЧасовойПояс = неопределено Тогда
		//Пробуем еще определить по контрагенту.
		ЧасовойПояс = табАид_ОбщегоНазначенияПереопределяемый.ПолучитьЧасовойПоясКонтрагента(Объект.Ссылка);
	КонецЕсли;
	
	Если ЧасовойПояс = неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить часовой пояс партнера. Проверьте заполнение адреса!");
	Иначе
		табАид_ЧасовойПояс = ЧасовойПояс;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура табАид_ПолучитьЧасовойПоясПосле(Команда)
	табАид_ПолучитьЧасовойПоясПослеНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура табАид_УстановитьВидимость()
	Элементы.табАид_ЧасовойПояс.Видимость = табАид_ДругойЧасовойПояс;
	Элементы.ПолучитьЧасовойПояс.Видимость = табАид_ДругойЧасовойПояс;
КонецПроцедуры

&НаКлиенте
Процедура табАид_ДругойЧасовойПоясПриИзмененииПосле(Элемент)
	табАид_УстановитьВидимость();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура табАид_ЧасовойПоясПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

