Функция ПреобразоватьСтрокуВДату(СтрокаДанных) Экспорт 
	
	//взято из ММ документа ОперацияПоЯндексКассе
	ДатаИзСтроки = ТекущаяДата();
	
	Если ТипЗнч(СтрокаДанных) = Тип("Строка") Тогда // Формат: dd.MM.yyyy HH:mm:ss или dd.MM.yyyy
		Попытка
			
			Если СтрДлина(СтрокаДанных) > 18 тогда  // Формат: dd.MM.yyyy HH:mm:ss
				СтрокаДаты = Лев(СтрокаДанных, 10);
				СтрокаВремени = Прав(СтрокаДанных, 8);
			иначе                                   // dd.MM.yyyy
				СтрокаДаты = Лев(СтрокаДанных, 10);
				СтрокаВремени = "";
			КонецЕсли;
			
			МассивДаты 		=  СтрРазделить(СтрокаДаты, ".", Ложь);
			МассивВремени 	= СтрРазделить(СтрокаВремени, ":", Ложь);
			
			Если МассивДаты.Количество() >= 3 тогда
				
				Для каждого ЭлементКоллекции Из МассивДаты Цикл
					ЭлементКоллекции = Число(СокрЛП(ЭлементКоллекции));
				КонецЦикла;
				
				Если МассивВремени.Количество() >= 3 Тогда
					Для каждого ЭлементКоллекции Из МассивВремени Цикл
						ЭлементКоллекции = Число(СокрЛП(ЭлементКоллекции));
					КонецЦикла;
				иначе
					МассивВремени.Добавить(0);//test comment
					МассивВремени.Добавить(0);
					МассивВремени.Добавить(0);
				КонецЕсли;	
				
				ДатаИзСтроки = Дата(МассивДаты[2], МассивДаты[1], МассивДаты[0], МассивВремени[0], МассивВремени[1], МассивВремени[2]);	
			КонецЕсли; 
			
		Исключение
			ДатаИзСтроки = ТекущаяДата();	
		КонецПопытки;
	ИначеЕсли ТипЗнч(СтрокаДанных) = Тип("Дата") Тогда	
		ДатаИзСтроки = СтрокаДанных;
	КонецЕсли; 

	Возврат ДатаИзСтроки;
	
КонецФункции