&Вместо("ВыполнитьОбработкуПоРегламентномуЗаданию")
Процедура АИД_ВыполнитьОбработкуПоРегламентномуЗаданию(ВнешняяОбработка, ДанныеКоманды) Экспорт
	
	//Аид
	ИдентификаторКоманды = "";
	ПараметрыКоманды = Новый Структура;
	Если ТипЗнч(ДанныеКоманды) = Тип("Структура") Тогда
		Если ДанныеКоманды.Свойство("ИдентификаторКоманды") Тогда
			ИдентификаторКоманды = ДанныеКоманды.ИдентификаторКоманды;
		КонецЕсли;
		Если ДанныеКоманды.Свойство("ПараметрыКоманды") Тогда
			ПараметрыКоманды = ДанныеКоманды.ПараметрыКоманды;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеКоманды) = Тип("Строка") Тогда
		ИдентификаторКоманды = ДанныеКоманды;
	КонецЕсли;
	//Аид
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
	
	// Запись журнала регистрации
	ЗаписатьИнформацию(ВнешняяОбработка, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Команда %1: Запуск.'"), ИдентификаторКоманды));
	
	// Выполнение команды
	Попытка
		//Аид
		ВыполнитьКоманду(Новый Структура("ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыКоманды", ВнешняяОбработка, ИдентификаторКоманды, ПараметрыКоманды), Неопределено);
		//Аид
	Исключение
		ЗаписатьОшибку(
			ВнешняяОбработка,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Команда %1: Ошибка выполнения:
				|%2'"),
				ИдентификаторКоманды, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки;
	
	// Запись журнала регистрации
	ЗаписатьИнформацию(ВнешняяОбработка, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Команда %1: Завершение.'"), ИдентификаторКоманды));
	
КонецПроцедуры
