
&НаКлиенте
Процедура СтатусСобытияПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	Элементы.ПолучитьФайлЗаписиГП.Видимость = (Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.ГолосовоеСообщение"));
	Элементы.ОбновитьСтатусДоставки.Видимость = (Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.ГолосовоеСообщение")
												ИЛИ Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.табАид_ТипыСообщений.SMS"));
	Элементы.ФормаЗаписатьИЗакрыть.Доступность = Ложь;
	Элементы.ФормаЗаписать.Доступность = Ложь;
	Элементы.ФормаСкопировать.Доступность = Ложь;
	Элементы.ФормаУдалить.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлЗаписиГП(Команда)
	
	Если ЗначениеЗаполнено(Запись.АдресФайла) Тогда
		Попытка
			//ЭтотОбъект.Браузер = Запись.АдресФайла;
			ПерейтиПоНавигационнойСсылке(Запись.АдресФайла);
		Исключение
			Сообщить("Ошибка получения файла аудиозаписи. " + ОписаниеОшибки());
		КонецПопытки;
	Иначе
		Сообщить("Не определен файл аудиозаписи.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусДоставки(Команда)
	Если Запись.СтатусСобытия = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение не было отправлено!");
		Возврат;	
	КонецЕсли;
	
	ОбновитьСтатусДоставкиНаСервере(Запись.УникальныйКлючЗаписи, Запись.ТипСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСтатусДоставкиНаСервере(ИдентификаторСообщения, ТипСообщения)
	
	Если ТипСообщения = Перечисления.табАид_ТипыСообщений.ГолосовоеСообщение Тогда 
		табАид_ОтправкаГолосовойПочты.СтатусДоставки(ИдентификаторСообщения);
	ИначеЕсли ТипСообщения = Перечисления.табАид_ТипыСообщений.SMS Тогда
		табАид_ОтправкаSMS.СтатусДоставки(ИдентификаторСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры



