
&НаСервере
Процедура табАид_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	табАид_СоздатьЭлементыФормыСервер();
	табАид_СтатусПартнера = Объект.табАид_СтатусПартнера;
КонецПроцедуры

&НаСервере
Процедура табАид_СоздатьЭлементыФормыСервер()
	Если Элементы.Найти("табАид_СтатусПартнера") = Неопределено тогда
		НовыйЭлементСтатусПартнера = Элементы.Вставить("табАид_СтатусПартнера", Тип("ПолеФормы"), Элементы.ГруппаОбщаяИнформация, Элементы.ГруппаАтрибутыНаименования);
		НовыйЭлементСтатусПартнера.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлементСтатусПартнера.ПутьКДанным = "Объект.табАид_СтатусПартнера";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура табАид_СтатусПартнераПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура табАид_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	ТекущийОбъект.табАид_СтатусПартнера = табАид_СтатусПартнера;
КонецПроцедуры

