
&НаСервере
Процедура ДатаАктуальностиДЗПриИзмененииНаСервере()
	ЗаписьДатыАктуальности = РегистрыСведений.Аид_ДатаАктуальностиДЗ.СоздатьМенеджерЗаписи();
	ЗаписьДатыАктуальности.Организация = Справочники.Организации.ПустаяСсылка();
	ЗаписьДатыАктуальности.ДатаАктуальностиДЗ = ДатаАктуальностиДЗ;
	ЗаписьДатыАктуальности.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктуальностиДЗПриИзменении(Элемент)
	ДатаАктуальностиДЗПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаАктуальностиДЗ = ПолучитьДатуАктуальностиДЗ();
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуАктуальностиДЗ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	        |	Аид_ДатаАктуальностиДЗ.ДатаАктуальностиДЗ КАК ДатаАктуальностиДЗ
	        |ИЗ
	        |	РегистрСведений.Аид_ДатаАктуальностиДЗ КАК Аид_ДатаАктуальностиДЗ
	        |ГДЕ
	        |	Аид_ДатаАктуальностиДЗ.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ДатаАктуальностиДЗ;
	КонецЕсли;
	Возврат Дата(1, 1, 1);
КонецФункции

