
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПараметрыЗаполнения") и ТипЗнч(Параметры.ПараметрыЗаполнения) = Тип("Структура") тогда
		 ТекущийОтбор = Параметры.ПараметрыЗаполнения.ТекущийОтбор;
		 ЭлементОтбора = СписокПравил.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");
		 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		 ЭлементОтбора.Использование = Истина;
		 ЭлементОтбора.ПравоеЗначение = ТекущийОтбор.Партнер;
	КонецЕсли;
	
КонецПроцедуры
