
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСобытияПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	Элементы.ТекстОшибки.Доступность    = Не Запись.СтатусСобытия;
	Элементы.ТекстСообщения.Доступность = Запись.СтатусСобытия;
	
	Элементы.ТекстОшибкиДоставки.Доступность    = Не Запись.СтатусДоставки;
	Элементы.ТекстДиалога.Доступность = Запись.СтатусДоставки;;
	
	Элементы.ПолучитьФайлЗаписиГП.Видимость = (Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.ГолосовоеСообщение"));
	Элементы.ОбновитьСтатусДоставки.Видимость = (Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.ГолосовоеСообщение")
												ИЛИ Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.SMS"));
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлЗаписиГП(Команда)
	
	Если ЗначениеЗаполнено(Запись.АдресФайла) Тогда
		Попытка
			//ЭтотОбъект.Браузер = Запись.АдресФайла;
			ПерейтиПоНавигационнойСсылке(Запись.АдресФайла);
		Исключение
			Сообщить("Ошибка получения файла аудиозаписи. " + ОписаниеОшибки());
		КонецПопытки;
	Иначе
		Сообщить("Не определен файл аудиозаписи.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусДоставки(Команда)
	Если Запись.СтатусСобытия = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение не было отправлено!");
		Возврат;	
	КонецЕсли;
	
	ОбновитьСтатусДоставкиНаСервере(Запись.УникальныйКлючЗаписи, Запись.ТипСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСтатусДоставкиНаСервере(ИдентификаторСообщения, ТипСообщения)
	
	Если ТипСообщения = Перечисления.Аид_ТипыСообщений.ГолосовоеСообщение Тогда 
		Аид_ОтправкаГолосовойПочты.СтатусДоставки(ИдентификаторСообщения);
	ИначеЕсли ТипСообщения = Перечисления.Аид_ТипыСообщений.SMS Тогда
		Аид_ОтправкаSMS.СтатусДоставки(ИдентификаторСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры



