
&НаКлиенте
Процедура Ок(Команда)
	Закрыть(Новый Структура("НаправлениеСмещения, КоличествоДней", ЭтотОбъект.НаправлениеСмещения, ЭтотОбъект.КоличествоДней));
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НаправлениеСмещения", ЭтотОбъект.НаправлениеСмещения);
	ЭтотОбъект.ТекстПояснения = "Смещение " + ?(ЭтотОбъект.НаправлениеСмещения >=0, "вперед", "назад")
								+ ". Укажите количество дней смещения.";
	ЭтотОбъект.КоличествоДней = 7;							
								
КонецПроцедуры
