
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДанныеОтчета = Параметры.ДанныеОтчета;
	Объект.ДетализацияОтчета = Параметры.ДетализацияОтчета; 
	ЭтотОбъект.ВсеДолги = Параметры.ВсеДолги;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Выбор = Новый Структура;
	Выбор.Вставить("ДанныеОтчета",Объект.ДанныеОтчета);
	Выбор.Вставить("ДетализацияОтчета",Объект.ДетализацияОтчета);
	Выбор.Вставить("ВсеДолги",ЭтотОбъект.ВсеДолги);
	Оповестить("НастрокаВМ",Выбор);
КонецПроцедуры
