
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВсехРеквизитов = Новый СписокЗначений;
	СписокВсехРеквизитов.Добавить("ИнтервалЗадолженности", "Интервал задолженности");
	СписокВсехРеквизитов.Добавить("ВидДоговора",           "Вид договора");
	СписокВсехРеквизитов.Добавить("Организация", "Организация");
	СписокВсехРеквизитов.Добавить("СтатусПартнера",        "Статус партнера");
	
	Если Параметры.Свойство("табАид_РеквизитыПостроенияИерарахии") тогда
		СписокЭлементов = Параметры.табАид_РеквизитыПостроенияИерарахии;
		ИндексИнтервала = СписокЭлементов.Индекс(СписокЭлементов.НайтиПоЗначению("ИнтервалЗадолженности"));
		Если ИндексИнтервала <> 0 Тогда 
			СписокЭлементов.Сдвинуть(СписокЭлементов.НайтиПоЗначению("ИнтервалЗадолженности"),-1);
		КонецЕсли;
		
		Для Каждого Элемент из СписокЭлементов Цикл
			ЭлементСписка = СписокВсехРеквизитов.НайтиПоЗначению(Элемент.Значение);
			Если Не ЭлементСписка = Неопределено тогда
				ЭтотОбъект.РеквизитыВыбранные.Добавить(Элемент.Значение, Элемент.Представление); 
				СписокВсехРеквизитов.Удалить(ЭлементСписка);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент из СписокВсехРеквизитов Цикл
			ЭтотОбъект.РеквизитыВсе.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЦикла;
	иначе
		ЭтотОбъект.РеквизитыВыбранные.ЗагрузитьЗначения(СписокВсехРеквизитов.ВыгрузитьЗначения());
	КонецЕсли;
	
	Если Параметры.Свойство("табАид_ВыводитьДоговор") Тогда
		ЭтотОбъект.ВыводитьДоговор = Параметры.табАид_ВыводитьДоговор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВправоВсе(Команда)
	
	Для Каждого ЗначениеРеквизит из ЭтотОбъект.РеквизитыВсе Цикл
		ЭтотОбъект.РеквизитыВыбранные.Добавить(ЗначениеРеквизит.Значение, ЗначениеРеквизит.Представление);	
	КонецЦикла;
	ЭтотОбъект.РеквизитыВсе.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВправоОдин(Команда)
	
	ТекущиеДанные = Элементы.РеквизитыВсе.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено и Не ПустаяСтрока(ТекущиеДанные.Значение) Тогда
		ЭтотОбъект.РеквизитыВыбранные.Добавить(ТекущиеДанные.Значение, ТекущиеДанные.Представление);
		ЭтотОбъект.РеквизитыВсе.Удалить(ЭтотОбъект.РеквизитыВсе.НайтиПоЗначению(ТекущиеДанные.Значение));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВлевоВсе(Команда)
	
	Для Каждого ЗначениеРеквизит из ЭтотОбъект.РеквизитыВыбранные Цикл
		Если Не ЗначениеРеквизит.Значение = "ИнтервалЗадолженности" тогда
			ЭтотОбъект.РеквизитыВсе.Добавить(ЗначениеРеквизит.Значение, ЗначениеРеквизит.Представление);
			ЭтотОбъект.РеквизитыВыбранные.Удалить(ЗначениеРеквизит);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВлевоОдин(Команда)
	
	ТекущиеДанные = Элементы.РеквизитыВыбранные.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено и Не ПустаяСтрока(ТекущиеДанные.Значение) Тогда
		Если ТекущиеДанные.Значение = "ИнтервалЗадолженности" тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Реквизит 'Интервал задолженности' всегда должен быть виден в дереве отчета.");
		иначе	
			ЭтотОбъект.РеквизитыВсе.Добавить(ТекущиеДанные.Значение, ТекущиеДанные.Представление);
			ЭтотОбъект.РеквизитыВыбранные.Удалить(ЭтотОбъект.РеквизитыВыбранные.НайтиПоЗначению(ТекущиеДанные.Значение));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Вверх(Команда)
	ТекущиеДанные = Элементы.РеквизитыВыбранные.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено и Не ПустаяСтрока(ТекущиеДанные.Значение) Тогда
		Если ЭтотОбъект.РеквизитыВыбранные.Индекс(ЭтотОбъект.РеквизитыВыбранные.НайтиПоЗначению(ТекущиеДанные.Значение)) > 1 тогда
			ЭтотОбъект.РеквизитыВыбранные.Сдвинуть(ЭтотОбъект.РеквизитыВыбранные.НайтиПоЗначению(ТекущиеДанные.Значение), -1);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Вниз(Команда)
	ТекущиеДанные = Элементы.РеквизитыВыбранные.ТекущиеДанные;
	Если ТекущиеДанные.Значение <> "ИнтервалЗадолженности" Тогда 
		Если ТекущиеДанные <> Неопределено и Не ПустаяСтрока(ТекущиеДанные.Значение) Тогда
			Если ЭтотОбъект.РеквизитыВыбранные.Индекс(ЭтотОбъект.РеквизитыВыбранные.НайтиПоЗначению(ТекущиеДанные.Значение)) < ЭтотОбъект.РеквизитыВыбранные.Количество() - 1 тогда
				ЭтотОбъект.РеквизитыВыбранные.Сдвинуть(ЭтотОбъект.РеквизитыВыбранные.НайтиПоЗначению(ТекущиеДанные.Значение), 1);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	СтруктураЗакрытия = Новый Структура("ВыводитьДоговор, РеквизитыВыбранные", ЭтотОбъект.ВыводитьДоговор, ЭтотОбъект.РеквизитыВыбранные);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры


