
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
 
    Оповещение = Новый ОписаниеОповещения("ПослеВводаСтрокиНужнаПомощь", 
        ЭтотОбъект);
		
    ПоказатьВводСтроки(
        Оповещение,
		    "Контактное лицо: " + Символы.ПС
			+ "Контактный телефон для обратной связи: " + Символы.ПС
			+ "Опишите кратко проблему: " + Символы.ПС, 
        "Опишите кратко проблему",
        0, // (необ.) длина
        Истина // (необ.) многострочность
    );
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры


&НаСервере
Процедура НужнаПомощьНаСервере(Текст)
	
	табАид_ОбщегоНазначенияПереопределяемый.ПолучитьПомощь(Текст, "Модуль ТАБ АИД");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтрокиНужнаПомощь(Результат, Параметры) Экспорт
 
    Если Не Результат = Неопределено Тогда
        НужнаПомощьНаСервере(Результат);
    КонецЕсли;
 
КонецПроцедуры
