
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипСообщения", ЭтотОбъект.ТипСообщенияОтбор) тогда
		Если ЭтотОбъект.ТипСообщенияОтбор = Перечисления.Аид_ТипыСообщений.Email тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список,"ПредназначенДляЭлектронныхПисем",Истина,,,Истина);
		ИначеЕсли ЭтотОбъект.ТипСообщенияОтбор = Перечисления.Аид_ТипыСообщений.SMS тогда	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список,"ПредназначенДляSMS",Истина,,,Истина);
		ИначеЕсли ЭтотОбъект.ТипСообщенияОтбор = Перечисления.Аид_ТипыСообщений.ГолосовоеСообщение тогда	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список,"Аид_ПредназначенДляГолосовогоСообщения",Истина,,,Истина);
		иначе
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПредназначенДляЭлектронныхПисем");
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПредназначенДляSMS");
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Аид_ПредназначенДляГолосовогоСообщения");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,"Назначение","АИД",,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	к = 1;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	к = 1;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	к = 1;
	//ПараметрыФормы = Новый Структура();
	//ПараметрыФормы.Вставить("ВидСообщения",           ТипСообщения);
	//ПараметрыФормы.Вставить("ПолноеИмяТипаОснования", Назначение);
	//ПараметрыФормы.Вставить("МожноМенятьНазначение",  Истина);
	//ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	к = 1;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблон(Команда)
	ВидСообщения = "";
	Если ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.ГолосовоеСообщение") Тогда
		ВидСообщения = "ГолосовоеСообщение";
	ИначеЕсли ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.SMS") Тогда
		ВидСообщения = "СообщениеSMS";
	ИначеЕсли ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.Email") Тогда
		ВидСообщения = "Почта";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидСообщения", ВидСообщения);
	ПараметрыФормы.Вставить("ЭтоАИД",       Истина);
	ОткрытьФорму("Справочник.Аид_ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры
